# Taps
tap "homebrew/cask-fonts"

# CLI
brew "awscli"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "htop"
brew "httpie"
brew "jq"
brew "nvm"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "stow"
brew "tealdeer"
brew "terraform"
brew "tmux"
brew "zoxide"
brew "trash-cli"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Apps
cask "1password"
cask "docker"
cask "figma"
cask "firefox"
cask "httpie"
cask "kap"
cask "keepingyouawake"
cask "raycast"
cask "rectangle-pro"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "yt-music"
cask "zoom"

# Fonts
cask "font-jetbrains-mono-nerd-font"

