# Taps
tap "homebrew/cask-fonts"

# CLI
brew "awscli"
brew "fzf"
brew "gh"
brew "go-task/tap/go-task"
brew "htop"
brew "httpie"
brew "jq"
brew "nvm"
brew "shellcheck"
brew "starship"
brew "stow"
brew "tealdeer"
brew "terraform"
brew "tmux"
brew "trash-cli"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Apps
cask "1password-cli"
cask "1password"
cask "alacritty"
cask "altair-graphql-client"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "hammerspoon"
cask "httpie"
cask "kap"
cask "keepingyouawake"
cask "logi-options-plus"
cask "logseq"
cask "loom"
cask "nordvpn"
cask "obs"
cask "phpstorm"
cask "postman"
cask "raycast"
cask "rectangle-pro"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "whatsapp"
cask "yt-music"
cask "zoom"

# Fonts
cask "font-jetbrains-mono-nerd-font"

