# Taps
tap "homebrew/cask-fonts"

# CLI
brew "awscli"
brew "helm"
brew "htop"
brew "httpie"
brew "fzf"
brew "gh"
brew "gnupg"
brew "jq"
brew "kubectl"
brew "mas"
brew "minikube"
brew "mysql-client"
brew "nvm"
brew "skaffold"
brew "starship"
brew "pinentry-mac"
brew "terraform"
brew "tmux"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Apps
cask "1password"
cask "chef-workstation"
cask "discord"
cask "docker"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "firefox"
cask "figma"
cask "kap"
cask "keepingyouawake"
cask "obs"
cask "phpstorm"
cask "postman"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "whatsapp"
cask "yt-music"
cask "zoom"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Mac App Store
mas "Xcode", id: 497799835

